{"keras_version": "2.2.0", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 148, 4], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}