{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.0", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 148, 4], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_1"}}